In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

default_dict = {'A': [0, 0, 1, 1, 2, 2],
                'B': [0, 1, 2, 3, 4, 5],
                'C': ['a', 'b', 'c', 'd', 'e', 'f']}

df = pd.DataFrame(default_dict)
s = pd.Series([0, 1, 2, 3, 4])

In [2]:
df

   A  B  C
0  0  0  a
1  0  1  b
2  1  2  c
3  1  3  d
4  2  4  e
5  2  5  f

#### Use ffill to replace values with the value above them in a column.
*0 is not replaced in column A as there is not a valid value above the value.*

In [3]:
df.replace([0, 2], method='ffill')

   A  B  C
0  0  0  a
1  0  1  b
2  1  1  c
3  1  3  d
4  1  4  e
5  1  5  f

#### Use bfill to replace values with the value below them in a column.

*2 is not replaced in column A as there is not a valid value below the value.*

In [4]:
df.replace([0, 2], method='bfill')

   A  B  C
0  1  1  a
1  1  1  b
2  1  3  c
3  1  3  d
4  2  4  e
5  2  5  f